app/controllers/index_controller.rb

  def page
  	@users = User.all
---
SELECT `users`.* FROM `users`