app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `fname`, `lname`, `password`, `updated_at`) VALUES ('2013-09-18 23:37:53', 'Ponciano', 'Vieira', 'lospalos123', '2013-09-18 23:37:53')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `password` = '1234', `updated_at` = '2013-09-22 23:49:20' WHERE `users`.`id` = 7
---
  def update
    respond_to do |format|
      if @user.update(user_params)